app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "updated_at", "username") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Wed, 19 Feb 2014 05:47:22 UTC +00:00], ["email", "tatyana@von.org"], ["updated_at", Wed, 19 Feb 2014 05:47:22 UTC +00:00], ["username", "sapiente"]]
---
  def create
    user = User.new(params[:user])
    if user.save